app/controllers/dashboard/events_controller.rb

SELECT "events".* FROM "events"
---
  def index
  	query = ''
    if(params[:q])
      query = params[:q]
    end
    @events = Event.search(query, params[:page])