app/controllers/dashboard/events_controller.rb

  def index
  	@events = Event.order(:name).page(params[:page]).per(10)
---
SELECT  "events".* FROM "events" ORDER BY "events"."name" ASC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]