app/controllers/dashboard/projects_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
  	query = ''
    if(params[:q])
      query = params[:q]
    end
    @projects = Project.search(query, params[:page])