app/controllers/dashboard/transfers_controller.rb

  def index
  	@transferences = Transfer.order(created_at: :desc).page(params[:page]).per(5)
---
SELECT  "transfers".* FROM "transfers" ORDER BY "transfers"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]