app/controllers/dashboard/users_controller.rb

  def index
  	 @users = User.order(:name).page(params[:page]).per(10)
---
SELECT  "users".* FROM "users" ORDER BY "users"."name" ASC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]