app/controllers/administrative/events_controller.rb

SELECT "events".* FROM "events"
---
  def index
    query = ''
    if(params[:q])
      query = params[:q]
    end
   @events = Event.search(query, params[:page])

INSERT INTO "events" ("name", "date", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ""], ["date", "2018-05-20"], ["description", ""], ["created_at", "2018-05-20 01:32:06.976697"], ["updated_at", "2018-05-20 01:32:06.976697"]]
---
  def create
    @event = Event.new(params_event)
    if @event.save

UPDATE "events" SET "description" = $1, "date" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["description", ""], ["date", "2018-05-20"], ["updated_at", "2018-05-20 01:15:40.751374"], ["id", 1]]
---
  def update
    if  @event.update(params_event)

DELETE FROM "events" WHERE "events"."id" = $1  [["id", 2]]
---
  def destroy
    if @event.present?
     # @event.users.clear #remove all associations
      @event.destroy