app/controllers/administrative/projects_controller.rb

  def index
    query = ''
    if(params[:q])
      query = params[:q]
    end
    @projects = Project.search(query, params[:page])
---
SELECT "projects".* FROM "projects"

  def create
    @project = Project.new(params_project)
    if @project.save
---
INSERT INTO "projects" ("name", "value", "description", "client", "expected_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "hey"], ["value", 0.0], ["description", ""], ["client", ""], ["expected_date", "2018-05-09"], ["created_at", "2018-05-25 22:33:59.056580"], ["updated_at", "2018-05-25 22:33:59.056580"]]

  def update
    if  @project.update(params_project)
---
UPDATE "projects" SET "name" = $1, "value" = $2, "client" = $3, "updated_at" = $4 WHERE "projects"."id" = $5  [["name", "VAMO LA GALERA "], ["value", 0.0], ["client", "LETS PLAU"], ["updated_at", "2018-05-25 22:36:53.979245"], ["id", 1]]

  def destroy
    if @project.present?

      @project.destroy
---
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 1]]