app/controllers/administrative/projects_controller.rb

SELECT  "projects".* FROM "projects" ORDER BY "projects"."name" ASC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
     @projects = Project.order(:name).page(params[:page]).per(10)