app/controllers/administrative/transfers_controller.rb

  def index
    @transferences = Transfer.order(created_at: :desc).page(params[:page]).per(5)
---
SELECT  "transfers".* FROM "transfers" ORDER BY "transfers"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "transfers"

  def create
    @transfer = Transfer.new(params_transfer)
    if @transfer.save
---
INSERT INTO "transfers" ("description", "category", "price_cents", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "TESTE NOVO"], ["category", 1], ["price_cents", 34400], ["created_at", "2018-05-23 19:02:26.612461"], ["updated_at", "2018-05-23 19:02:26.612461"]]

  def update
    if @transfer.update(params_transfer)
---
UPDATE "transfers" SET "category" = $1, "updated_at" = $2 WHERE "transfers"."id" = $3  [["category", 1], ["updated_at", "2018-05-23 18:51:06.053872"], ["id", 87]]

  def destroy
    if @transfer.destroy
---
DELETE FROM "transfers" WHERE "transfers"."id" = $1  [["id", 101]]

    def set_transfer
      @transfer = Transfer.find(params[:id])
---
SELECT  "transfers".* FROM "transfers" WHERE "transfers"."id" = $1 LIMIT $2  [["id", 101], ["LIMIT", 1]]