app/views/dashboard/profile/edit.html.erb

            <li class="list-group-item">
              <b>Projetos</b> <a class="pull-right"><%= @user.contributions.count %></a>
---
SELECT COUNT(*) FROM "contributions" WHERE "contributions"."user_id" = $1  [["user_id", 1]]

            <li class="list-group-item">
              <b>Eventos</b> <a class="pull-right"><%= @user.participations.count %></a>
---
SELECT COUNT(*) FROM "participations" WHERE "participations"."user_id" = $1  [["user_id", 1]]